# Практические задания по Python: Вложенные функции (Nested Functions)

## 📖 Введение: Что такое вложенная функция?

**Вложенная (или внутренняя) функция** — это функция, которая определена внутри другой (внешней) функции. Она имеет доступ к переменным из области видимости внешней функции.

```python
def outer():
    def inner():
        print("Привет из вложенной функции!")
    inner()

outer()
```

---

## 🟢 Легкие задачи (⭐)

### Задача 1: Система приветствия пользователей
**Описание:** Напишите функцию `greet_user(name)`, которая принимает имя пользователя. Внутри неё создайте вложенную функцию, которая генерирует и возвращает приветственное сообщение.

* **Входные данные:** `"Али"`
* **Выходные данные:** `"Привет, Али!"`

### Задача 2: Скидка в интернет-магазине
**Описание:** Напишите функцию `final_price(price)`, которая принимает исходную цену. Внутри неё создайте вложенную функцию, которая рассчитывает и применяет скидку 10%.

* **Входные данные:** `100`
* **Выходные данные:** `90.0`

### Задача 3: Проверка пароля
**Описание:** Напишите функцию `check_password(password)`, которая валидирует строку. Внутри неё создайте вложенную функцию для проверки того, что длина пароля составляет не менее 8 символов. Возвращайте `True` или строку `"Надежный пароль"`, если проверка пройдена.

* **Входные данные:** `"python123"`
* **Выходные данные:** `"Надежный пароль"`

---

## 🟡 Средние задачи (⭐⭐)

### Задача 4: Отчет об оценках студента
**Описание:** Напишите функцию `student_report(grades)`, которая принимает список оценок (чисел). Внутри неё создайте две вложенные функции:
* `calculate_average()` — возвращает средний балл.
* `find_highest()` — возвращает максимальный балл.

Основная функция должна возвращать оба значения в виде кортежа или отформатированной строки.

* **Входные данные:** `[80, 90, 70, 100]`
* **Выходные данные:** `Средний: 85, Высший: 100`

### Задача 5: Калькулятор зарплаты сотрудника
**Описание:** Напишите функцию `salary_report(base_salary)`. Внутри неё создайте две вложенные функции:
* `tax()` — рассчитывает налог в размере 15% от базовой ставки.
* `bonus()` — рассчитывает премию в размере 20% от базовой ставки.

Основная функция должна рассчитать и вернуть финальную зарплату по формуле: `base_salary - tax + bonus`.

* **Входные данные:** `5000`
* **Выходные данные:** `Финальная зарплата: 5250.0`

### Задача 6: Сводка заказа в e-commerce
**Описание:** Напишите функцию `order_summary(prices)`, которая принимает список цен на товары в корзине. Внутри неё создайте вложенные функции для вычисления общей стоимости заказа и средней цены товара. Верните оба результата.

* **Входные данные:** `[100, 200, 300]`
* **Выходные данные:** `Итого: 600, Средняя цена: 200`

### Задача 7: Аналитика текста
**Описание:** Напишите функцию `analyze_text(text)`, которая принимает предложение (строку). Внутри неё определите две вложенные функции:
* `word_count()` — считает общее количество слов в тексте.
* `longest_word()` — находит самое длинное слово.

* **Входные данные:** `"Python очень мощный язык"`
* **Выходные данные:** `Слов: 4, Самое длинное: мощный`

---

## 🔴 Сложные задачи (⭐⭐⭐)

### Задача 8: Система банковского счета (Замыкание)
**Описание:** Напишите функцию `bank_account(initial_balance)`, которая инициализирует баланс счета. Внутри неё определите две вложенные функции:
* `deposit(amount)` — увеличивает баланс на указанную сумму.
* `withdraw(amount)` — уменьшает баланс при условии, что на счету достаточно средств.

**Дополнительное условие:** Чтобы функции можно было вызывать извне, верните их из `bank_account` в виде словаря или кортежа (используя концепцию замыканий). Не забывайте использовать ключевое слово `nonlocal` для изменения баланса.

* **Пример работы:**
  ```python
  account = bank_account(1000)
  account['deposit'](500)   # Новый баланс: 1500
  account['withdraw'](200)  # Новый баланс: 1300
  ```

### Задача 9: Калькулятор-множитель
**Описание:** Создайте функцию `make_multiplier(factor)`. Внутри неё определите вложенную функцию `multiply(number)`, которая умножает переданное число на `factor`, полученный внешней функцией. Верните внутреннюю функцию.

* **Пример работы:**
  ```python
  double = make_multiplier(2)
  print(double(5)) # Вывод: 10
  
  triple = make_multiplier(3)
  print(triple(5)) # Вывод: 15
  ```