type_db = {
    'воин': {'атака': 20, 'здоровье': 250, 'защита': 5},
    'лучник': {'атака': 30, 'здоровье': 100, 'защита': 7},
    'маг': {'атака': 15, 'здоровье': 80, 'защита': 20},
    'асасин': {'атака': 18, 'здоровье': 300, 'защита': 25},
    'убийца': {'атака': 45, 'здоровье': 90, 'защита': 4},
    'арбалетчик': {'атака': 40, 'здоровье': 120, 'защита': 10},
    'копейщик': {'атака': 25, 'здоровье': 150, 'защита': 12},
    'стрелок': {'атака': 35, 'здоровье': 95, 'защита': 6},
    'жрец': {'атака': 12, 'здоровье': 140, 'защита': 18},
    'монах': {'атака': 28, 'здоровье': 130, 'защита': 15}
}

weapon_db = {
    'меч': 20,
    'топор': 18,
    'лук': 22,
    'посох': 20,
    'кинжал': 15,
    'копье': 21,
    'булава': 19,
    'арбалет': 24,
    'молот': 25,
    'кнут': 16,
    'коса': 22,
    'сабля': 19,
    'цеп': 20,
}
def create_person(name, type, weapon):
    hero = {
        'имя': name,
        'класс': type,
        'хп': type_db[type]['здоровье'],
        'атака': type_db[type]['атака'],
        'защита': type_db[type]['защита'],
        'оружие': weapon,
    }
    return hero

print(create_person(
    input('Введите имя: '),
    input('Введите тип персонажа: '), 
    input('Введите оружие: ')
))